
&НаКлиенте
Процедура Расчитать(Команда)
	ДеньКредита = ДатаВзятияЗайма;
	СуммаКредита = СуммаЗайма; 
	//КоличествоДнейВГоду = 365;
	//ДеньГода(31.12.2022) =365;
	//КонецГода(13.10.2022) = 31.12.2022;
	//ДеньКредита = 13.10.2022;
	Если ДосрочноеПогашение Тогда
		КонечнаяРасчетнаяДата = ДатаДосрочногоПогашения;
	Иначе
		КонечнаяРасчетнаяДата = ДатаОкончанияЗайма; 
	КонецЕсли
		
	Пока НачалоДня(ДеньКредита)<= НачалоДня(КонечнаяРасчетнаяДата)Цикл 
		Если ДеньНедели(ДеньКредита) >= 6 Тогда
		ДеньКредита = ДобавитьДень(ДеньКредита);
		Продолжить;
	КонецЕсли;
	КоличествоДнейВГоду = ДеньГода(КонецГода(ДеньКредита));
	ДневнаяСтавка = ГодовыеПроценты/100/КоличествоДнейВГоду;
	ДневнаяСумма = СуммаКредита*ДневнаяСтавка;
	СуммаКредита = СуммаКредита+ДневнаяСумма;
	ДеньКредита = ДобавитьДень(ДеньКредита);
	КонецЦикла;
    КонечнаяСумма = СуммаКредита;
	Переплата = КонечнаяСумма - СуммаЗайма;
	КонецПроцедуры 
	
&НаКлиенте
Функция ДобавитьДень(Дата)
	Возврат Дата+60*60*24;
КонецФункции
